# შექმენით 6 სტრიქონის სია, რომლებიც წარმოადგენენ სხვადასხვა ხილს: ['ვაშლი', 'ბანანი', 'ალუბალი', 'თარიღი', 'ლეღვი', 'ყურძენი']. 
#1შეცვალეთ სია ჭრის გამოყენებით და ამობეჭდეთ შებრუნებული სია.
#2შეცვალეთ შუა ორი ხილი ['კივი', 'ცაცხვი'] სიის ჭრის გამოყენებით და დაბეჭდეთ განახლებული სია.



lst = ["ვაშლი", "ბანანი", "ალუბალი", "თარიღი", "ლეღვი", "ყურძენი"]
reverse_lst = lst[::-1]
print(reverse_lst)


lst = ["ვაშლი", "ბანანი", "ალუბალი", "თარიღი", "ლეღვი", "ყურძენი"]
lst [1] ="კივი"
lst [2] ="ცაცხვი"
print(lst)




