#1. მომხმარებელს შემოატანინეთ ჯერ სახელი, ხოლო შემდეგ გვარი. ორივე მონაცემი შეინახეთ ცვლადებში და ბოლოს დაბეჭდეთ ერთი დიდი წინადადება, რომელშიც გექნებათ სახელიც და გვარიც.
#2. შექმენით ცვლადი, სადაც შეინახავთ თქვენთვის სასურველ რიცხვს. შემდეგ შექმენით მეორე ცვლადი, სადაც მომხმარებელს შემოატანინებთ რიცხვს. თქვენი დავალებაა, რომ დაბეჭდოთ ამ ორი რიცხვის ჯამი.
#3. შექმენით სამი ცვლადი, თითოეულში შეინახეთ რიცხვი. თქვენი დავალებაა, რომ ამ სამი რიცხვის ჯამი გაყოთ მათ რაოდენობაზე და დაბეჭდოთ ეს შედეგი.
#4. პირველ რიგში, მომხმარებელს შემოატანინეთ სთრინგი და ის გაამრავლეთ ხუთზე. შემდეგ შემოატანინეთ რიცხვი და ისიც გაამრავლეთ ხუთზე. ორივე შედეგი დაბეჭდეთ და კომენტარების გამოყენებით აღწერეთ თითოეული.
#5. მომხმარებელს შემოატანინეთ ორი რიცხვი. თქვენი დავალებაა შექმნათ კალკულატორი, დაბეჭდეთ: რიცხვების ჯამი (num1 + num2), სხვაობა (num1 - num2), ნამრავლი (num1 * num2), განაყოფი (num1 / num2)


a =input ("შეიყვანე შენი სახელი :")
b =input ("შეიყვანე შენი გვარი :")
print (a +" "+ b)


a =int (input ("შეიყვანე შენი რიცხვი :"))
b =int (input ("შეიყვანე შენი რიცხვი :"))
print (a + b)


a =int (input("შეიყვანე შენი რიცხვი :"))
b =int (input("შეიყვანე შენი რიცხვი :"))
c =int (input("შეიყვანე შენი რიცხვი :"))
d =int (input("შეიყვანე შენი რიცხვი :"))
print (a + b + c / d)







