# 4) დავალება
#დაწერეთ პროგრამა სადაც შეამოწმეთ, სტუდენტმა ჩააბარა თუ არა ჩააბარა კურსი მათი გამოცდის 
#ქულების მიხედვით. სთხოვეთ მომხმარებელს შეიყვანოს ქულები შუალედური გამოცდისთვის, დასკვნითი 
#გამოცდისთვის და პროექტისთვის. დარწმუნდით, რომ მომხმარებელმა შეიყვანოს სწორი ქულები (პოზიტიური რიცხვები 0-დან 100-მდე) 
#თითოეული კომპონენტისთვის.
#გამოიყენეთ შემდეგი შეფასების კრიტერიუმები: თუ საშუალო ქულა (20% შუალედური კურსისთვის, 4
# და 40% პროექტისთვის) არის 70 ან მეტი, სტუდენტი გაივლის კურსს. თუ საშუალო ქულა 70-ზე დაბალია, 
#სტუდენტი ვერ ახერხებს კურსის ჩაბარებას. აჩვენეთ მომხმარებლისთვის შეტყობინება, რომელშიც მითითებულია მისი 
#გავლის/ჩავარდნის სტატუსი და გამოთვლილი საშუალო ქულა.




exam_score =int(input("enter your score: "))
if exam_score<0 and exam_score>100:
    print("exam score not good")


project_score =int(input("enter your score: "))
if project_score<0 and project_score>100:
    print("project score not good")



average =(exam_score + project_score)/2

if average >= 70:
    print("you have passed the course")
else:
    print("you have faled the course")

















